STMicroelectronics/stm32-mw-usbpd-ucsi/ppm.c
/**
  ******************************************************************************
  * @file    ppm.c
  * @author  MCD Application Team
  * @brief   PPM file
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "ppm.h"
#include "usbpd_dpm_core.h"
#include "usbpd_dpm_conf.h"
#include "usbpd_dpm_user.h"
#include "usbpd_pwr_if.h"
#if defined(_RTOS)
#include "cmsis_os.h"
#endif /* _RTOS */
#if defined(_TRACE)
#include "usbpd_trace.h"
#include "stdio.h"
#endif /* _TRACE */
#include "string.h"

/** @addtogroup STM32_USBPD_LIBRARY
  * @{
  */

/** @addtogroup USBPD_CORE
  * @{
  */

/** @addtogroup USBPD_CORE_PPM
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  UCSI_VERSION_t      UcsiVersion;
  UCSI_SET_NOTIFICATION_ENABLE_t SetNotificationEnable;
  UCSI_GET_CAPABILITY_IN_t Capability;
  UCSI_GET_CONNECTOR_CAPABILITY_IN_t ConnectorCapability[USBPD_PORT_COUNT];
  UCSI_CC_OPERATION_MODE_t CC_Mode[USBPD_PORT_COUNT];
  UCSI_USB_OPERATION_ROLE_t USB_Role[USBPD_PORT_COUNT];
  UCSI_POWER_DIRECTION_MODE_t PowerMode[USBPD_PORT_COUNT];
  UCSI_POWER_DIRECTION_ROLE_t PowerRole[USBPD_PORT_COUNT];
  /* Used for I2C data transfer*/
  UCSI_CCI_t          AckCCI_Status;
  UCSI_CONTROL_t      Control;
  UCSI_MESSAGE_IN_t   MessageIn;
  UCSI_MESSAGE_OUT_t  MessageOut;
  uint8_t           Error;
} PPM_HandleTypeDef;

/* Private define ------------------------------------------------------------*/
/* Optional Features */
#define FEATURE_SET_UOM_SUPPORTED                     0U
#define FEATURE_SET_POWER_LEVEL_SUPPORTED             0U
#if defined(_VDM)
#define FEATURE_ALTERNATEMODEDETAILS_SUPPORTED        0U
#define FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED       0U
#endif /* _VDM */
#define FEATURE_PDODETAILS_SUPPORTED                  1U
#define FEATURE_CABLEDETAILS_SUPPORTED                0U
#define FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED  0U
#define FEATURE_PDRESETNOTIFICATION_SUPPORTED         0U
#define FEATURE_GET_PD_MESSAGE_SUPPORTED              0U

#if defined(_TRACE)
#define PPM_DEBUG_NONE     (0U)
#define PPM_DEBUG_LEVEL_0  (1U << 0)
#define PPM_DEBUG_LEVEL_1  (1U << 1)
#define PPM_DEBUG_LEVEL_2  (1U << 2)
#endif /* _TRACE */

#ifndef __IO
#define __IO    volatile        /* __IO macro definition */
#endif /* __IO */

/* Format event
[ PORT | XX | YY | EVENT ]*/
#define MASK_EVENT                              0xFFU
#define SET_PORT_EVENT(__PORT__, __EVENT__)     (((__PORT__) << 24) | (__EVENT__))
#define GET_PORT_EVENT(__EVENT__)               (((__EVENT__) >> 24) & 0xFFU)

typedef enum
{
  PPM_USER_EVENT_TIMER,         /* TIMER EVENT           */
  PPM_USER_EVENT_COMMAND,       /* COMMAND RECEIVED      */
  PPM_USER_EVENT_NOTIFICATION,  /* NOTIFICATION RECEIVED */
  PPM_USER_EVENT_NONE,          /* NO EVENT              */
} PPM_USER_EVENT;

#ifdef _RTOS
#define PPM_BOX_MESSAGES_MAX                    2U
#define FREERTOS_PPM_PRIORITY                   osPriorityLow
#define FREERTOS_PPM_STACK_SIZE                 256U
#endif /* _RTOS */

#define PPM_WAIT_ACK_TIMEOUT      1000U /* Timeout in ms for which to stay in state PPM_WAIT_FOR_CMD_COMPL_ACK */

typedef enum
{
  PPM_IDLE_NOT_READY,             /* PPM Idle (notification disabled) */
  PPM_IDLE_READY,                 /* PPM Idle (notification enabled)  */
  PPM_BUSY,                       /* PPM Busy                         */
  PPM_WAIT_FOR_ASYNCH_EVENT_ACK,  /* Wait for asynch event ack        */
  PPM_PROCESSING_COMMAND,         /* Processing command               */
  PPM_WAIT_FOR_CMD_COMPL_ACK,     /* Wait for command completion ack  */
} PPM_STATE;

/* Private macro -------------------------------------------------------------*/
#if defined(_TRACE)
#define PPM_DEBUG(_LEVEL_, _PORT_, __MSG__)                                                     \
  do                                                                                            \
  {                                                                                             \
    if((PPM_DebugLevel & (_LEVEL_)) == (_LEVEL_))                                               \
    {                                                                                           \
      USBPD_TRACE_Add(USBPD_TRACE_DEBUG, (_PORT_), 0U,(uint8_t*)(__MSG__), sizeof(__MSG__));    \
    }                                                                                           \
  } while(0);

#define PPM_DEBUG_WITH_ARG(_LEVEL_, _PORT_, ...)                                                \
  do                                                                                            \
  {                                                                                             \
    if ((PPM_DebugLevel & (_LEVEL_)) == (_LEVEL_))                                              \
    {                                                                                           \
      char _str[70U];                                                                           \
      (void)snprintf(_str, 70U, __VA_ARGS__);                                                   \
      USBPD_TRACE_Add(USBPD_TRACE_DEBUG, (uint8_t)(_PORT_), 0U, (uint8_t*)_str, strlen(_str));  \
    }                                                                                           \
  } while(0);
#define PPM_TRACE(_LEVEL_, _ID_, _PTR_DATA_, _SIZE_)                                            \
  do                                                                                            \
  {                                                                                             \
    if ((PPM_DebugLevel & (_LEVEL_)) == (_LEVEL_))                                              \
    {                                                                                           \
      USBPD_TRACE_Add(USBPD_TRACE_UCSI, 0U, _ID_, _PTR_DATA_, _SIZE_);                          \
    }                                                                                           \
  } while(0);
#else
#define PPM_TRACE(_LEVEL_,  _ID_, _PTR_DATA_, _SIZE_)
#define PPM_DEBUG(_LEVEL_, _PORT_, __MSG__)
#define PPM_DEBUG_WITH_ARG(_LEVEL_, _PORT_, ...)
#endif /* _TRACE */

#if defined(_TRACE)
#define SWITCH_TO_PPM_STATE(_STATE_)                                                            \
  do                                                                                            \
  {                                                                                             \
    PPM_State = (_STATE_);                                                                      \
    if (PPM_State != PPM_PreviousState)                                                         \
    {                                                                                           \
      PPM_PreviousState = PPM_State;                                                            \
      PPM_TRACE(PPM_DEBUG_LEVEL_2, UCSI_TRACE_PPM_STATE, (uint8_t*)&PPM_State, 1U);             \
    }                                                                                           \
  } while(0);
#else
#define SWITCH_TO_PPM_STATE(_STATE_)    PPM_State = (_STATE_);
#endif /* _TRACE */

/* Private variables ---------------------------------------------------------*/
#if defined(_TRACE)
uint8_t PPM_DebugLevel = /*PPM_DEBUG_LEVEL_2 | */PPM_DEBUG_LEVEL_1 | PPM_DEBUG_LEVEL_0 | PPM_DEBUG_NONE;
#endif /* _TRACE */

PPM_HandleTypeDef PPM_Handle;
extern USBPD_HandleTypeDef DPM_Ports[USBPD_PORT_COUNT];

#if defined(_RTOS)
osMessageQId  PPMMsgBox;
static void                 USBPD_PPM_UserExecute(void const *argument);

#if (osCMSIS < 0x20000U)
osThreadDef(PPM, USBPD_PPM_UserExecute, FREERTOS_PPM_PRIORITY, 0U, FREERTOS_PPM_STACK_SIZE);
#else /* osCMSIS >= 0x20000U */
osThreadAttr_t PPM_Thread_Atrr =
{
  .name       = "PPM",
  .priority   = FREERTOS_PPM_PRIORITY,
  .stack_size = FREERTOS_PPM_STACK_SIZE
};
