STMicroelectronics/stm32-mw-usbpd-ucsi/ppm.c
          PPM_Handle.AckCCI_Status.ConnectorChangeIndicator = AsynchEventPending;
          if (PPM_Handle.Error == 1U)
          {
            PPM_Handle.AckCCI_Status.ErrorIndicator = 1U;
            PPM_Handle.Error = 0U;
          }
          PPM_NotifyOPM(0U, 1U);
          PPM_TRACE(PPM_DEBUG_LEVEL_1, UCSI_TRACE_PPM_EVENT, (uint8_t *)&PPM_Handle.AckCCI_Status.AsUInt32, 4U);
          /* Clear Async event pending */
          AsynchEventPending = 0U;
        }
        break;
      case PPM_BUSY:                       /* PPM Busy                        */
      case PPM_PROCESSING_COMMAND:         /* Processing command              */
      case PPM_WAIT_FOR_CMD_COMPL_ACK:     /* Wait for command completion ack */
        if (PPM_Handle.AckCCI_Status.AcknowledgeCommandIndicator)
        {
          /* Switch to PPM Idle (Notification enabled) */
          SWITCH_TO_PPM_STATE(PPM_IDLE_READY);
        }
        else
        {
          /* Manage timeout in case OPM never ack command */
            if ((HAL_GetTick() - tickstart) > PPM_WAIT_ACK_TIMEOUT) /* 1s timeout */
            {
              PPM_DEBUG(PPM_DEBUG_LEVEL_1, USBPD_PORT_0,
                        "PPM_WAIT_FOR_CMD_COMPL_ACK timeout. Switching to state PPM_IDLE_READY");

              /* Abort waiting */
              PPM_Handle.AckCCI_Status.AcknowledgeCommandIndicator = 1U;
              SWITCH_TO_PPM_STATE(PPM_IDLE_READY);
            }
        }
      default:
        break;
    }

    if (0U != AsynchEventPending)
    {
      /* 2 Asynch has been raised. 1st one has been correctly managed. */
      _timing = 0U;
    }
    else
    {
      _timing = osWaitForever;
    }
  } while (1);
}
#elif defined(USE_STM32_UTILITY_OS)
#else
#warning "NRTOS Version not implemented"
#endif /* _RTOS */

/**
  * @brief  Get data pointer saved in PPM Handle
  * @param  Register
  * @retval Pointer of data
  */
uint8_t *USBPD_PPM_GetDataPointer(UCSI_REG_t Register)
{
#if defined(_TRACE)
  if (Register < UcsiRegDataStructureUnkown)
  {
    PPM_TRACE(PPM_DEBUG_LEVEL_2, UCSI_TRACE_PPM_GET_REG, (uint8_t *)&Register, 1U);
  }
#endif /* _TRACE */
  uint8_t *ptr = NULL;
  switch (Register)
  {
    case UcsiRegDataStructureVersion:
      ptr = (uint8_t *)&PPM_Handle.UcsiVersion;
      break;
    case UcsiRegDataStructureCci:
      ptr = (uint8_t *)&PPM_Handle.AckCCI_Status;
      break;
    case UcsiRegDataStructureControl:
      ptr = (uint8_t *)&PPM_Handle.Control;
      break;
    case UcsiRegDataStructureMessageIn:
      ptr = (uint8_t *)&PPM_Handle.MessageIn;
      PPM_TRACE(PPM_DEBUG_LEVEL_1, UCSI_TRACE_PPM_GET_REG, (uint8_t *)&PPM_Handle.MessageIn, UCSI_MAX_DATA_LENGTH);
      break;
    case UcsiRegDataStructureMessageOut:
      ptr = (uint8_t *)&PPM_Handle.MessageOut;
      break;
    case UcsiRegDataStructureUnkown:
    case UcsiRegDataStructureReserved:
    default:
      PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_GET_REG_ERROR_READ, (uint8_t *)&PPM_Handle.AckCCI_Status.AsUInt32, 4U);
      break;
  }

  return ptr;
}

/**
  * @brief  Callback function called by PE to inform DPM about PE event.
  * @param  PortNumber  The current port number
  * @param  EventVal    USBPD_NotifyEventValue_TypeDef
  * @retval None
  */
void USBPD_PPM_Notification(uint8_t PortNumber, uint32_t EventType)
{
  /*
  Mandatory:
  PPM_Handle.SetNotificationEnable.CommandComplete;
  PPM_Handle.SetNotificationEnable.PowerOperationModeChange;
  PPM_Handle.SetNotificationEnable.BatteryChargingStatusChange;
  PPM_Handle.SetNotificationEnable.ConnectorPartnerChange;
  PPM_Handle.SetNotificationEnable.PowerDirectionChange;
  PPM_Handle.SetNotificationEnable.ConnectChange;
  PPM_Handle.SetNotificationEnable.Error;

  Optional: */
#if FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED
  PPM_Handle.SetNotificationEnable.ExternalSupplyChange;
#endif /* FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED */
#if FEATURE_PDODETAILS_SUPPORTED
  PPM_Handle.SetNotificationEnable.SupportedProviderCapabilitiesChange = 1U;
  PPM_Handle.SetNotificationEnable.NegotiatedPowerLevelChange = 1U;
#endif /* FEATURE_PDODETAILS_SUPPORTED */
#if FEATURE_PDRESETNOTIFICATION_SUPPORTED
  PPM_Handle.SetNotificationEnable.PdResetComplete;
#endif /* FEATURE_PDRESETNOTIFICATION_SUPPORTED */
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
  PPM_Handle.SetNotificationEnable.SupportedCamChange;
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */

  if (PPM_Handle.SetNotificationEnable.ConnectChange)
  {
    switch (EventType)
    {
      case USBPD_NOTIFY_DATAROLESWAP_NOT_SUPPORTED:
        PPM_Handle.Error                  = 1U;
      /* Event for attach */
      case USBPD_NOTIFY_POWER_EXPLICIT_CONTRACT :
      /* Event for detach */
      case USBPD_NOTIFY_DETACH :
      /* Event for Data Role Swap  */
      case USBPD_NOTIFY_DATAROLESWAP_UFP:
      case USBPD_NOTIFY_DATAROLESWAP_DFP:
      case USBPD_NOTIFY_USBSTACK_START:
      case USBPD_NOTIFY_PE_DISABLED:
      /* A notification has been detected */
      {
        uint32_t event = SET_PORT_EVENT(PortNumber, PPM_USER_EVENT_NOTIFICATION);
        ConnectorChange[PortNumber] = UCSI_CONNECTOR_CHANGE;
        /* Wake up PPM only if there are no pending Asynck event */
        if (AsynchEventPending == 0U)
        {
          AsynchEventPending = (PortNumber + 1U);
#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
          if (osOK != osMessagePut(PPMMsgBox, event, 0U))
          {
            PPM_DEBUG(PPM_DEBUG_LEVEL_0, PortNumber, "NOTIF1: MB FULL\r\n");
          }
#else
          (void)osMessageQueuePut(PPMMsgBox, &event, 0U, NULL);
#endif /* osCMSIS < 0x20000U */
#elif defined(USE_STM32_UTILITY_OS)
#else
#warning " NRTOS Version not implemented"
#endif /* _RTOS */
        }
      }
      break;
      default:
        break;
    }
  }

  /* No notifications match */
  return;
}

void USBPD_PPM_PostCommand(void)
{
  uint32_t event = PPM_USER_EVENT_COMMAND;
#if defined(_RTOS)
#if (osCMSIS < 0x20000U)
  if (osOK != osMessagePut(PPMMsgBox, event, 0U))
  {
    PPM_DEBUG(PPM_DEBUG_LEVEL_0, 0U, "COMMAND: MB FULL\r\n");
  }
#else
  (void)osMessageQueuePut(PPMMsgBox, &event, 0U, NULL);
#endif /* osCMSIS < 0x20000U */
#elif defined(USE_STM32_UTILITY_OS)
#else
#warning " NRTOS Version not implemented"
#endif /* _RTOS */
  /* PPM Update Command Pending */
  CommandPending = 1U;
}

/**
  * @}
  */

/** @addtogroup USBPD_CORE_PPM_Private_Functions
  * @{
  */
static void PPM_ManageCommandNotReady(PUCSI_CONTROL_t PtrControl)
{
  UCSI_COMMAND_t command = (UCSI_COMMAND_t)PtrControl->Command;
  PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_NOT_READY, (uint8_t *)PtrControl, 8U);
  if (UcsiCommandPpmReset == command)
  {
    /* Disable all the notifications */
    PPM_Reset();
  }
  else if (UcsiCommandSetNotificationEnable == command)
  {
    PPM_SetNotificationEnable(PtrControl->SetNotificationEnable.Content.NotificationEnable);

    PPM_NotifyOPM(1U, 0U);
    SWITCH_TO_PPM_STATE(PPM_WAIT_FOR_CMD_COMPL_ACK);
  }
  /* Clear Command pending */
  CommandPending = 0U;
}

static void PPM_ManageCommandReady(PUCSI_CONTROL_t PtrControl)
{
  UCSI_COMMAND_t command = (UCSI_COMMAND_t)PtrControl->Command;
  PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY, (uint8_t *)PtrControl, 8U);

  if (UcsiCommandPpmReset == command)
  {
    /* Disable all the notifications */
    PPM_Reset();
  }
  else if (UcsiCommandCancel == command)
  {
    /* Cancel current operation if not yet processing */
    PPM_Cancel();

    /* Notificy OPM */
    PPM_NotifyOPM(1U, 0U);
  }
  else
  {
    /* if PPM is busy or command need to take more one UCSI_MIN_TIME_TO_RESPOND_WITH_BUSY ms set busy indicator */
    if (PPM_BUSY == PPM_State) /* || Cmd Need UCSI_MIN_TIME_TO_RESPOND_WITH_BUSY */
    {
      /* Reset Status variable */
      PPM_Handle.AckCCI_Status.AsUInt32 = 0U;
      /* Acknowledge the command */
      PPM_Handle.AckCCI_Status.BusyIndicator = 1U;
      /* Notificy OPM */
      PPM_NotifyOPM(1U, 0U);
      SWITCH_TO_PPM_STATE(PPM_PROCESSING_COMMAND);
    }
    else
    {
      switch (command)
      {
        case UcsiCommandConnectorReset:
        {
          CurrentPort = (PtrControl->ConnectorReset.ConnectorNumber - 1U);
          PPM_ConnectorReset(CurrentPort, PtrControl->ConnectorReset.HardReset);
        }
        break;
        case UcsiCommandAckCcCi:
          CurrentPort = (PtrControl->ConnectorReset.ConnectorNumber - 1U);
          PPM_AckCcCi(PtrControl->AckCcCi.ConnectorChangeAcknowledge, PtrControl->AckCcCi.CommandCompletedAcknowledge);
          break;
        case UcsiCommandSetNotificationEnable:
          PPM_SetNotificationEnable(PtrControl->SetNotificationEnable.Content.NotificationEnable);
          break;
        case UcsiCommandGetCapability:
          PPM_GetCapabilityStatus();
          break;
        case UcsiCommandGetConnectorCapability:
          CurrentPort = (PtrControl->GetConnectorCapability.ConnectorNumber - 1U);
          PPM_GetConnectorCapabilityStatus(CurrentPort);
          break;
        case UcsiCommandSetUor:
        {
          CurrentPort = (PtrControl->SetUor.ConnectorNumber - 1U);
          PPM_SetUSB_OperationRole(CurrentPort, (UCSI_USB_OPERATION_ROLE_t)PtrControl->SetUor.UsbOperationRole);
        }
        break;
        case UcsiCommandSetPdr:
        {
          CurrentPort = (PtrControl->SetPdr.ConnectorNumber - 1U);
          PPM_SetPowerDirectionRole(CurrentPort, (UCSI_POWER_DIRECTION_ROLE_t)PtrControl->SetPdr.PowerDirectionRole);
        }
        break;
        case UcsiCommandGetConnectorStatus:
        {
          CurrentPort = (PtrControl->GetConnectorStatus.ConnectorNumber - 1U);
          PPM_GetConnectorStatus(CurrentPort);
        }
        break;
        case UcsiCommandGetErrorStatus:
          PPM_GetErrorStatus();
          break;
        case UcsiCommandSetCCom:
          CurrentPort = (PtrControl->SetUom.ConnectorNumber - 1U);
#if FEATURE_SET_UOM_SUPPORTED
          PPM_SetCC_OperationMode(CurrentPort, (UCSI_CC_OPERATION_MODE_t)PtrControl->SetUom.UsbOperationMode);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_SET_UOM_SUPPORTED */
          break;
        /* Obsolete from Rev1.2, Jan20*/
        case UcsiCommandSetPdm:
          CurrentPort = (PtrControl->SetPdm.ConnectorNumber - 1U);
#if FEATURE_SET_PDM_SUPPORTED
          PPM_SetPowerDirectionMode(CurrentPort, (UCSI_POWER_DIRECTION_MODE_t)PtrControl->SetPdm.PowerDirectionMode);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_SET_PDM_SUPPORTED */
          break;
        case UcsiCommandGetAlternateModes:
          CurrentPort = (PtrControl->GetAlternateModes.ConnectorNumber - 1U);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
          PPM_GetAlternateModes(CurrentPort, &PtrControl->GetAlternateModes);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
          break;
        case UcsiCommandGetCamSupported:
          CurrentPort = (PtrControl->GetCamSupported.ConnectorNumber - 1U);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
          PPM_GetCamSupported(CurrentPort);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
          break;
        case UcsiCommandGetCurrentCam:
          CurrentPort = (PtrControl->GetCurrentCam.ConnectorNumber - 1U);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
          PPM_GetCurrentCam(CurrentPort);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
          break;
        case UcsiCommandSetNewCam:
          CurrentPort = (PtrControl->SetNewCam.ConnectorNumber - 1U);
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED && FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED
          PPM_SetNewCam(CurrentPort, PtrControl->SetNewCam.EnterOrExit, PtrControl->SetNewCam.NewCam,
                        PtrControl->SetNewCam.AmSpecific);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED && FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED */
          break;
        case UcsiCommandGetPdos:
          CurrentPort = (PtrControl->GetPdos.ConnectorNumber - 1U);
#if FEATURE_PDODETAILS_SUPPORTED
          PPM_GetPDOs(CurrentPort, &PtrControl->GetPdos);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_PDODETAILS_SUPPORTED */
          break;
        case UcsiCommandGetCableProperty:
          CurrentPort = (PtrControl->GetCableProperty.ConnectorNumber - 1U);
#if FEATURE_CABLEDETAILS_SUPPORTED
          PPM_GetCableProperty(CurrentPort);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_CABLEDETAILS_SUPPORTED */
          break;
        case UcsiCommandSetPowerLevel:
          CurrentPort = (PtrControl->SetPowerLevel.ConnectorNumber - 1U);
#if FEATURE_SET_POWER_LEVEL_SUPPORTED
          PPM_SetPowerLevel(PtrControl->SetPowerLevel);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_SET_POWER_LEVEL_SUPPORTED */
          break;
        case UcsiCommandGetPDMessage:
          CurrentPort = (PtrControl->GetPDMessage.ConnectorNumber - 1U);
#if FEATURE_GET_PD_MESSAGE_SUPPORTED
          PPM_GetPDMessage(PtrControl->GetPDMessage);
#else
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
#endif /* FEATURE_GET_PD_MESSAGE_SUPPORTED */
          break;
        default:
          PPM_TRACE(PPM_DEBUG_LEVEL_0, UCSI_TRACE_PPM_READY_UNKNOWN, NULL, 0U);
          PPM_UnknownCommand(CurrentPort);
          break;
      }
      /* Notificy OPM */
      PPM_NotifyOPM(1U, 0U);
      SWITCH_TO_PPM_STATE(PPM_WAIT_FOR_CMD_COMPL_ACK);
    }
  }
  /* Clear Command pending */
  CommandPending = 0U;
}

