STMicroelectronics/stm32-mw-usbpd-ucsi/ppm.c
  /* Possible only if port is DRP */
  if (1U == DPM_Settings[PortNumber].PE_RoleSwap)
  {
    /* Save the CC operation mode */
    PPM_Handle.CC_Mode[PortNumber] = Mode;
  }
  else
  {
    PPM_Handle.AckCCI_Status.ErrorIndicator = 1U;
  }

  return USBPD_OK;
}
#endif /* FEATURE_SET_UOM_SUPPORTED */

/**
  * @brief  Set new USB operation role in USB-PD stack (Required)
  * @param  PortNumber  Port Number value
  * @param  Role  USB Role can take the following value
  *               @arg UcsiUsbOperationRoleDfp
  *               @arg UcsiUsbOperationRoleUfp
  *               @arg UcsiUsbOperationRoleAcceptSwap
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_SetUSB_OperationRole(uint8_t PortNumber, UCSI_USB_OPERATION_ROLE_t Role)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Save the USB operation mode */
  PPM_Handle.USB_Role[PortNumber] = Role;

  /* No effect and command failed:
     - if connector does not have an active connection */
  /* Check if device is connected or not */
  PPM_Handle.AckCCI_Status.ErrorIndicator  = 1U;

  /* Fields valid only in connect status set to 1 */
  if (DPM_Params[PortNumber].PE_IsConnected)
  {
    PPM_Handle.AckCCI_Status.ErrorIndicator  = 0U;
    /* No effect and command successfully:
     - if connector is already in the operation role   */
    if (((USBPD_PORTDATAROLE_UFP == DPM_Params[PortNumber].PE_DataRole)
         && ((UcsiUsbOperationRoleDfp | UcsiUsbOperationRoleAcceptSwap) == Role))
        || ((USBPD_PORTDATAROLE_DFP == DPM_Params[PortNumber].PE_DataRole)
            && ((UcsiUsbOperationRoleUfp | UcsiUsbOperationRoleAcceptSwap) == Role)))
    {
      /* Initiate a DR swap*/
      USBPD_DPM_RequestDataRoleSwap(PortNumber);
    }
  }
  /* Command should be compatible with current operation mode */

  return USBPD_OK;
}

#if FEATURE_SET_PDM_SUPPORTED
/**
  * @brief  Set new Power Direction mode in USB-PD stack (Optional)
  * @param  PortNumber  Port Number value
  * @param  PowerMode   Power direction Mode based on UCSI_POWER_DIRECTION_MODE_t
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_SetPowerDirectionMode(uint8_t PortNumber, UCSI_POWER_DIRECTION_MODE_t PowerMode)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Save the Power Direction Mode */
  PPM_Handle.PowerMode[PortNumber] = PowerMode;

  return USBPD_OK;
}
#endif /* FEATURE_SET_PDM_SUPPORTED */

/**
  * @brief  Set new Power Direction role in USB-PD stack (Required)
  * @param  PortNumber  Port Number value
  * @param  PowerRole   Power direction Mode based on UCSI_POWER_DIRECTION_ROLE_t
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_SetPowerDirectionRole(uint8_t PortNumber, UCSI_POWER_DIRECTION_ROLE_t PowerRole)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  /* Save the Power Direction Role*/
  PPM_Handle.PowerRole[PortNumber] = PowerRole;

  /* Initiate a DR swap*/
  if (USBPD_OK != USBPD_DPM_RequestPowerRoleSwap(PortNumber))
  {
    PPM_Handle.AckCCI_Status.ErrorIndicator  = 1U;
  }
  return USBPD_OK;
}

#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
/**
  * @brief  Set new Power Direction role in USB-PD stack (Optional)
  * @param  PortNumber  Port Number value
  * @param  PtrGetAlternatesModes  Pointer to a get alternate modes command
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_GetAlternateModes(uint8_t PortNumber,
                                                  PUCSI_GET_ALTERNATE_MODES_COMMAND PtrGetAlternatesModes)
{
  USBPD_StatusTypeDef status = USBPD_OK;

  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  PPM_DEBUG(PortNumber, "ADVICE: Update PPM_GetAlternateModes");

  return status;
}

/**
  * @brief  Manage reception of GET_CAM_SUPPORTED message (Optional)
  * @param  PortNumber  Port Number value
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_GetCamSupported(uint8_t PortNumber)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  PPM_DEBUG(PortNumber, "ADVICE: Update PPM_GetCamSupported");

  return USBPD_OK;
}

/**
  * @brief  Manage reception of GET_CURRENT_CAM message (Optional)
  * @param  PortNumber  Port Number value
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_GetCurrentCam(uint8_t PortNumber)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  PPM_DEBUG(PortNumber, "ADVICE: Update PPM_GetCurrentCam");

  return USBPD_OK;
}

#if FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED
/**
  * @brief  Manage reception of SET_NEW_CAM message (Optional)
  * @param  PortNumber  Port Number value
  * @param  EnterOrExit PPM wants to enter (1U) or exit (0U) in this alternate mode
  * @param  NewCAM      Offset into the list of alternates modes that PPM wants to operate in
  * @param  AMSpecific  Content of the specific alternate mode (ex DP status)
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_SetNewCam(uint8_t PortNumber, uint8_t EnterOrExit, uint8_t NewCAM, uint32_t AMSpecific)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  PPM_DEBUG(PortNumber, "ADVICE: Update PPM_SetNewCam");

  return USBPD_OK;
}
#endif /* FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED */
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */

#if FEATURE_PDODETAILS_SUPPORTED
/**
  * @brief  Manage reception of GET_PDOS message (Optional)
  * @param  PortNumber  Port Number value
  * @param  PtrGetPdos  Pointer to the UCSI_GET_PDOS_COMMAND structure
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_GetPDOs(uint8_t PortNumber, PUCSI_GET_PDOS_COMMAND_t PtrGetPdos)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

