STMicroelectronics/stm32-mw-usbpd-ucsi/ppm.c
  uint8_t nbPDO;
  uint8_t maxnbPDOSNK;
  uint8_t maxnbPDOSRC;
  uint32_t *ptrListPDOSRC;
  uint32_t *ptrListPDOSNK;

  /* Retrieve the PDOs associated with the connector */
  if (PtrGetPdos->PartnerPdo == 0U)
  {
#if defined (_GUI_INTERFACE)
    maxnbPDOSNK = USBPD_NbPDO[0];
    maxnbPDOSRC = USBPD_NbPDO[1];
#else
    maxnbPDOSNK = (uint8_t)PORT0_NB_SINKPDO;
    maxnbPDOSRC = (uint8_t)PORT0_NB_SINKPDO;
#endif /* _GUI_INTERFACE */
    ptrListPDOSRC = PORT0_PDO_ListSRC;
    ptrListPDOSNK = PORT0_PDO_ListSNK;
  }
  /* Retrieve the PDOs of the device attached to the connector */
  else
  {
    maxnbPDOSNK = DPM_Ports[PortNumber].DPM_NumberOfRcvSNKPDO;
    maxnbPDOSRC = DPM_Ports[PortNumber].DPM_NumberOfRcvSRCPDO;
    ptrListPDOSRC = DPM_Ports[PortNumber].DPM_ListOfRcvSRCPDO;
    ptrListPDOSNK = DPM_Ports[PortNumber].DPM_ListOfRcvSNKPDO;
  }

  if (PtrGetPdos->SourceOrSinkPdos == UcsiGetPdosTypeSource)
  {
    /* Get the min between the asked number of PDOs and the available source PDOs after offset to avoid overflow */
    nbPDO = MIN((PtrGetPdos->NumberOfPdos + 1U), maxnbPDOSRC - PtrGetPdos->PdoOffset);
  }
  else
  {
    /* Get the min between the asked number of PDOs and the available sink PDOs after offset to avoid overflow  */
    nbPDO = MIN((PtrGetPdos->NumberOfPdos + 1U), maxnbPDOSNK - PtrGetPdos->PdoOffset);
  }

  /* DataLength field is 4 x Number of PDOs up to UCSI_MAX_DATA_LENGTH */
  if ((4U * nbPDO) > UCSI_MAX_DATA_LENGTH)
  {
    nbPDO = UCSI_MAX_DATA_LENGTH / 4U;
  }
  PPM_Handle.AckCCI_Status.DataLength = 4U * nbPDO;

  /* Reset the returned PDOs */
  memset(PPM_Handle.MessageIn.Pdos.Pdos, 0x00U, sizeof(PPM_Handle.MessageIn.Pdos.Pdos));

  /* Fill the structure UCSI_GET_PDOS_IN_t */
  if (PtrGetPdos->SourceOrSinkPdos == UcsiGetPdosTypeSource)
  {
    memcpy(PPM_Handle.MessageIn.Pdos.Pdos, ptrListPDOSRC + PtrGetPdos->PdoOffset, sizeof(uint32_t) * nbPDO);
  }
  else
  {
    memcpy(PPM_Handle.MessageIn.Pdos.Pdos, ptrListPDOSNK + PtrGetPdos->PdoOffset, sizeof(uint32_t) * nbPDO);
  }

  return USBPD_OK;
}
#endif /* FEATURE_PDODETAILS_SUPPORTED */

#if FEATURE_CABLEDETAILS_SUPPORTED
/**
  * @brief  Manage reception of GET_CABLE_PROPERTY message (Optional)
  * @param  PortNumber  Port Number value
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_GetCableProperty(uint8_t PortNumber)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.ConnectorChangeIndicator  = AsynchEventPending;

  PPM_DEBUG(PortNumber, "ADVICE: Update PPM_GetCableProperty");

  return USBPD_OK;
}
#endif /* FEATURE_CABLEDETAILS_SUPPORTED */

/**
  * @brief  Get the connector status (Required)
  * @param  PortNumber  Port Number value
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_GetConnectorStatus(uint8_t PortNumber)
{
  PUCSI_GET_CONNECTOR_STATUS_IN_t p_connector_status = &PPM_Handle.MessageIn.ConnectorStatus;

  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;
  PPM_Handle.AckCCI_Status.DataLength = 0x09U;

  /* Fill ConnectorStatusChange if a new connector change has been notified */
  if (ConnectorChange[PortNumber] == UCSI_CONNECTOR_CHANGE)
  {
    /* Fill the ConnectorStatusChange */
    p_connector_status->ConnectorStatusChange.AsUInt16                            = 0x0000U;
#if FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED
    p_connector_status->ConnectorStatusChange.ExternalSupplyChange                = 0U;
#endif /* FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED */
    p_connector_status->ConnectorStatusChange.PowerOperationModeChange            = 1U;
    p_connector_status->ConnectorStatusChange.SupportedProviderCapabilitiesChange = 0U;
    p_connector_status->ConnectorStatusChange.NegotiatedPowerLevelChange          = 0U;
#if FEATURE_PDRESETNOTIFICATION_SUPPORTED
    p_connector_status->ConnectorStatusChange.PdResetComplete                     = 0U;
#endif /* FEATURE_PDRESETNOTIFICATION_SUPPORTED */
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
    p_connector_status->ConnectorStatusChange.SupportedCamChange                  = 0U;
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
    p_connector_status->ConnectorStatusChange.BatteryChargingStatusChange         = 0U;
    p_connector_status->ConnectorStatusChange.ConnectorPartnerChange              = 0U;
    p_connector_status->ConnectorStatusChange.PowerDirectionChange                = 1U;
    p_connector_status->ConnectorStatusChange.ConnectChange                       = 1U;
    p_connector_status->ConnectorStatusChange.Error                               = 0U;
  }

  /* Reset current notification */
  ConnectorChange[PortNumber] = UCSI_CONNECTOR_IDLE;

  /* Check if device is connected or not */
  p_connector_status->ConnectStatus         = DPM_Params[PortNumber].PE_IsConnected;

  /* Fields valid only in connect status set to 1 */
  if (p_connector_status->ConnectStatus)
  {
    if (USBPD_POWER_EXPLICITCONTRACT == DPM_Params[PortNumber].PE_Power)
    {
      p_connector_status->PowerOperationMode = UcsiPowerOperationModePd;
    }
    else
    {
      p_connector_status->PowerOperationMode = UcsiPowerOperationModeDefaultUsb;
      if (USBPD_PORTPOWERROLE_SNK == DPM_Params[PortNumber].PE_PowerRole)
      {
        p_connector_status->PowerOperationMode = UcsiPowerOperationModeDefaultUsb;
        if (vRd_3_0A == DPM_Params[PortNumber].SNKExposedRP_AtAttach)
        {
          p_connector_status->PowerOperationMode = UcsiPowerOperationModeTypeC3000;
        }
        else
        {
          if (vRd_1_5A == DPM_Params[PortNumber].SNKExposedRP_AtAttach)
          {
            p_connector_status->PowerOperationMode = UcsiPowerOperationModeTypeC1500;
          }
        }
      }
    }
    p_connector_status->PowerDirection = (UCSI_POWER_DIRECTION_t)(USBPD_PORTPOWERROLE_SRC ==
                                                                  DPM_Params[PortNumber].PE_PowerRole);

    p_connector_status->ConnectorPartnerFlags = UcsiConnectorPartnerFlagUsb;

#if defined(_VDM)
    if (DPM_Settings[PortNumber].PE_VDMSupport = USBPD_TRUE)
    {
      p_connector_status->ConnectorPartnerFlags |= UcsiConnectorPartnerFlagAlternateMode;
    }
#endif /* _VDM */

    /* Need to get information if cable is connected or not (information from CAD) */
    if (USBPD_PORTDATAROLE_UFP == DPM_Params[PortNumber].PE_DataRole)
    {
      p_connector_status->ConnectorPartnerType  = UcsiConnectorPartnerTypeDfp;
    }
    else
    {
      p_connector_status->ConnectorPartnerType  = UcsiConnectorPartnerTypeUfp;
    }

