STMicroelectronics/stm32-mw-usbpd-ucsi/ppm.c
    if (UcsiPowerDirectionConsumer == p_connector_status->PowerDirection)
    {
      p_connector_status->BatteryChargingStatus     = UcsiBatteryChargingNotCharging;
    }
    else
    {
      p_connector_status->bmPowerBudgetLimitedReason.PowerBudgetLowered       = 0U;
      p_connector_status->bmPowerBudgetLimitedReason.ReachingPowerBudgetLimit = 0U;
    }
  }
  else
  {
    p_connector_status->PowerOperationMode        = UcsiPowerOperationModeNoConsumer;
    p_connector_status->PowerDirection            = UcsiPowerDirectionConsumer;
    p_connector_status->ConnectorPartnerFlags     = 0U;
    p_connector_status->ConnectorPartnerType      = UcsiConnectorPartnerUnknown;
    p_connector_status->BatteryChargingStatus     = UcsiBatteryChargingNotCharging;
    p_connector_status->PowerBudgetLimitedReason  = 0U;

  }

#if FEATURE_PDODETAILS_SUPPORTED
  /* Field valid only in connect status set to 1 and power operation mode is set to PD */
  if (p_connector_status->ConnectStatus && (UcsiPowerOperationModePd == p_connector_status->PowerOperationMode))
  {
    /* Return the negotiated power level */
    USBPD_PWR_IF_SearchRequestedPDO(PortNumber, DPM_Ports[PortNumber].DPM_RDOPosition,
                                    &p_connector_status->RequestDataObject);
  }
  else
#endif /* FEATURE_PDODETAILS_SUPPORTED */
  {
    p_connector_status->RequestDataObject     = 0U;
  }
  return USBPD_OK;
}

/**
  * @brief  Manage reception of GET_ERROR_STATUS message (Required)
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_GetErrorStatus(void)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;

  PPM_Handle.AckCCI_Status.DataLength = UCSI_GET_ERROR_STATUS_DATA_LENGTH;

  return USBPD_OK;
}
#if FEATURE_SET_POWER_LEVEL_SUPPORTED
/**
  * @brief  Manage reception of SET POWER LEVEL message (Optional)
  * @note Command used by OPM to set the max negiable power level of Sink
  *           or Source
  * @param  PtrSetPowerLevel  Pointer on Set Power Level Command
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_SetPowerLevel(PUCSI_SET_POWER_LEVEL_COMMAND PtrSetPowerLevel)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;

  /* Command has no effect and set Error information to Invalid Command (InvalidCommandParametersError):
      - no active connection
      - Power direction does not match */

  /* If command is valid, complete the command and renegotiate a power contract is necessary */
  return USBPD_OK;
}
#endif /* FEATURE_SET_POWER_LEVEL_SUPPORTED */

#if FEATURE_GET_PD_MESSAGE_SUPPORTED
/**
  * @brief  Manage reception of GET PD MESSAGE message (Optional)
  * @param  PtrGetPDMessage  Pointer on Get PD Message Command
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_GetPDMessage(PUCSI_GET_PD_MESSAGE_COMMAND PtrGetPDMessage)
{
  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator = 1U;

  return USBPD_OK;
}
#endif /* FEATURE_GET_PD_MESSAGE_SUPPORTED */

/**
  * @brief  Manage reception of Unknown command message (Required)
  * @retval USBPD status
  */
static USBPD_StatusTypeDef  PPM_UnknownCommand(uint8_t PortNumber)
{
  PUCSI_GET_ERROR_STATUS_IN_t p_error_status;

  if (PortNumber >= USBPD_PORT_COUNT)
  {
    PortNumber = USBPD_PORT_0;
    PPM_DEBUG(PPM_DEBUG_LEVEL_0, 0U, "UnknownCommand WRONG PORT");
  }

  p_error_status = &PPM_Handle.MessageIn.ErrorStatus;
  p_error_status->ErrorInformation.AsUInt16                 = 0U;
  p_error_status->ErrorInformation.UnrecognizedCommandError = 1U;

  /* Reset Status variable */
  PPM_Handle.AckCCI_Status.AsUInt32 = 0U;

  /* Acknowledge the command */
  PPM_Handle.AckCCI_Status.CommandCompletedIndicator  = 1U;
  PPM_Handle.AckCCI_Status.NotSupportedIndicator      = 1U;

  return USBPD_OK;
}

/**
  * @brief  Fill the default configuration used by the USB-PD stack
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_FillDefaultConfiguration(void)
{
  USBPD_StatusTypeDef status = USBPD_OK;

  PUCSI_VERSION_t _version = &PPM_Handle.UcsiVersion;

  /* UCSI revision 1.2 (January 2020) */
  _version->MajorVersion    = 0x1U;
  _version->MinorVersion    = 0x2U;
  _version->SubMinorVersion = 0x0U;

  PUCSI_GET_CAPABILITY_IN_t _pcabability = &PPM_Handle.Capability;

  /* Fill the capability bmAttributes */
  _pcabability->bmAttributes.DisabledStateSupport  = 1U;
  _pcabability->bmAttributes.BatteryCharging       = 0U;
  _pcabability->bmAttributes.UsbPowerDelivery      = 1U;
  _pcabability->bmAttributes.UsbTypeCCurrent       = 1U;
  _pcabability->bmAttributes.bmPowerSource         = (1U << 6); /* Uses VBUS */

  /* Fill the Number of connectors */
  _pcabability->bNumConnectors  = USBPD_PORT_COUNT;

  /* Fill the capability bmOptionalFeatures */
  bmOptionalFeatures_t feature;
  feature.AsUInt32 = 0U;
  feature.SetCComSupported                     = FEATURE_SET_UOM_SUPPORTED;
  feature.SetPowerLevelSupported               = FEATURE_SET_POWER_LEVEL_SUPPORTED;
#if FEATURE_ALTERNATEMODEDETAILS_SUPPORTED
  feature.AlternateModeDetailsSupported        = FEATURE_ALTERNATEMODEDETAILS_SUPPORTED;
#endif /* FEATURE_ALTERNATEMODEDETAILS_SUPPORTED */
#if FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED
  feature.AlternateModeOverrideSupported       = FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED;
#endif /* FEATURE_ALTERNATEMODEOVERRIDE_SUPPORTED */
  feature.PdoDetailsSupported                  = FEATURE_PDODETAILS_SUPPORTED;
  feature.CableDetailsSupported                = FEATURE_CABLEDETAILS_SUPPORTED;
  feature.ExternalSupplyNotificationSupported  = FEATURE_EXTERNALSUPPLYNOTIFICATION_SUPPORTED;
  feature.PdResetNotificationSupported         = FEATURE_PDRESETNOTIFICATION_SUPPORTED;
  feature.GetPDMessageSupported                = FEATURE_GET_PD_MESSAGE_SUPPORTED;
  _pcabability->OptionalFeatures = feature.AsUInt32;

  /* Fill the Number of supported alternate modes */
#if defined(_VDM)
  _pcabability->bNumAltModes  = 1U;
#else
  _pcabability->bNumAltModes  = 0U;
#endif /* _VDM */

