STMicroelectronics/stm32-mw-usbpd-ucsi/ppm.c
  /* Fill Battery Charging Specification Release number */
  _pcabability->bcdBcVersion  = 0x0000U;

  /* Fill USB-PD Specification Release number */
  if (USBPD_SPECIFICATION_REV2 == DPM_Settings[USBPD_PORT_0].PE_SpecRevision)
  {
    _pcabability->bcdPdVersion  = 0x0200U;
  }
  else
  {
    _pcabability->bcdPdVersion  = 0x0300U;
  }

  /* Fill USB-Type C Specification Release number */
  _pcabability->bcdUsbTypeCVersion  = 0x0200U;

  return status;
}

/**
  * @brief  Fill the connector capability configuration used by the USB-PD stack
  * @param  PortNumber    PortNumber number value
  * @param  _pcabability  Pointer on UCSI_GET_CONNECTOR_CAPABILITY_IN structure
  * @retval USBPD status
  */
static USBPD_StatusTypeDef PPM_FillConnectorCapability(uint8_t PortNumber,
                                                       PUCSI_GET_CONNECTOR_CAPABILITY_IN_t PtrConnectorCapability)
{
  USBPD_StatusTypeDef status = USBPD_OK;

  /* Fill the connector capability OperationMode */
  if (1U == DPM_Settings[PortNumber].PE_RoleSwap)
  {
    /* Allow OPM to request a DRS as defined port is defined as DRD
          Port defined as TYPEC_PORT_DRD on OPM side */
    PtrConnectorCapability->OperationMode.Drp                = 1U;
    /* Does not care but set to 1 anyway */
    PtrConnectorCapability->OperationMode.RpOnly             = 1U;
    PtrConnectorCapability->OperationMode.RdOnly             = 1U;
  }
  else
  {
    /* DRS not supported */
    PtrConnectorCapability->OperationMode.Drp                 = 0U;
    /* Check default Data role of port */
    if (USBPD_PORTPOWERROLE_SRC == DPM_Settings[PortNumber].PE_DefaultRole)
    {
      /* Port defined as TYPEC_PORT_DFP on OPM side */
      PtrConnectorCapability->OperationMode.RpOnly             = 1U;
      PtrConnectorCapability->OperationMode.RdOnly             = 0U;
    }
    else
    {
      /* Port defined as TYPEC_PORT_UFP on OPM side */
      PtrConnectorCapability->OperationMode.RpOnly             = 0U;
      PtrConnectorCapability->OperationMode.RdOnly             = 1U;
    }
  }
  PtrConnectorCapability->OperationMode.AudioAccessoryMode  = 0U;
  PtrConnectorCapability->OperationMode.DebugAccessoryMode  = 0U;

  /* Retrieve if USB is supported from first PDO */
  if (PORT0_PDO_ListSRC[0U] & USBPD_PDO_SRC_FIXED_USBCOMM_SUPPORTED)
  {
    PtrConnectorCapability->OperationMode.Usb2                = 0U;
  }
  PtrConnectorCapability->OperationMode.Usb3                = 0U;
  PtrConnectorCapability->OperationMode.AlternateMode       = DPM_Settings[PortNumber].PE_VDMSupport;

  /* Fill the connector capability Provider/Consumer */
  if (1U == DPM_Settings[PortNumber].PE_RoleSwap)
  {
    /* Port defined as TYPEC_PORT_DRP on OPM side */
    PtrConnectorCapability->Provider       = 1U;
    PtrConnectorCapability->Consumer       = 1U;

    /* Power Role Swap supported */
    PtrConnectorCapability->SwapToSRC      = 1U;
    PtrConnectorCapability->SwapToSNK      = 1U;
  }
  else
  {
    if (USBPD_PORTPOWERROLE_SRC == DPM_Settings[PortNumber].PE_DefaultRole)
    {
      /* Port defined as TYPEC_PORT_SRC on OPM side */
      PtrConnectorCapability->Provider       = 1U;
      PtrConnectorCapability->Consumer       = 0U;
    }
    else
    {
      /* Port defined as TYPEC_PORT_SNK on OPM side */
      PtrConnectorCapability->Provider       = 0U;
      PtrConnectorCapability->Consumer       = 1U;
    }

    /* Power Role Swap not supported */
    PtrConnectorCapability->SwapToSRC      = 1U;
    PtrConnectorCapability->SwapToSNK      = 1U;
  }

  /* Fill the connector capability Data Role Support */
  PtrConnectorCapability->SwapToDFP = DPM_USER_Settings[PortNumber].PE_DR_Swap_To_DFP;
  PtrConnectorCapability->SwapToUFP = DPM_USER_Settings[PortNumber].PE_DR_Swap_To_UFP;

  return status;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
